/*В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.*/

public class Case21 {
    public static void main(String[] args) {
        double a = 9.49;
        double b = (double)Math.round(a);
        System.out.println(b);
//        double w =5.33;
//        double x = (double)Math.round(w);
//        System.out.println(x);
    }
}
