/*В переменной n хранится вещественное число с ненулевой дробной частью.
Создайте программу, округляющую число n до ближайшего целого и выводящую результат на экран.*/

public class Case2 {
    public static void main(String[] args) {
        double a = 2.9;
        int x = (int)(a + 0.5);
        System.out.println(x);
            }
}